In [1]:
try:
    file = open('new_file.csv','x')
    file.close()
except:
    print("The file is already there!")

In [ ]:
#!pip install pandas

In [4]:
import pandas as pd
df = pd.read_csv('new_file.csv')
df

   sn   name  age        add        phone
0   1    Ram   34  Kathmandu   9808667654
1   2  Shyam   56  Bhaktapur    980889887
2   3   Hari   67   Lalitpur   9808667654
3   4  Nabin   89       Bara  98400346765
4   5  Sabin   78    Chitwan   9808667654
5   6   Rita   23      Jhapa   9808776865

In [5]:
import pandas as pd
df = pd.read_csv('new_file.csv',nrows = 2)
df

   sn   name  age        add       phone
0   1    Ram   34  Kathmandu  9808667654
1   2  Shyam   56  Bhaktapur   980889887

In [7]:
import pandas as pd
df = pd.read_csv('new_file.csv')
df.head(3)

   sn   name  age        add       phone
0   1    Ram   34  Kathmandu  9808667654
1   2  Shyam   56  Bhaktapur   980889887
2   3   Hari   67   Lalitpur  9808667654

In [8]:
import pandas as pd
df = pd.read_csv('new_file.csv')
df.tail(3)

   sn   name  age      add        phone
3   4  Nabin   89     Bara  98400346765
4   5  Sabin   78  Chitwan   9808667654
5   6   Rita   23    Jhapa   9808776865

In [ ]:
### df = pd.read_csv('new_file.csv')
df.iloc[1:4]

In [11]:
df = pd.read_csv('new_file.csv')
df.iloc[1:4,0:3]

   sn   name  age
1   2  Shyam   56
2   3   Hari   67
3   4  Nabin   89

In [14]:
df = pd.read_csv('new_file.csv',usecols = ['sn','name','phone'])
df

   sn   name        phone
0   1    Ram   9808667654
1   2  Shyam    980889887
2   3   Hari   9808667654
3   4  Nabin  98400346765
4   5  Sabin   9808667654
5   6   Rita   9808776865

In [26]:
df = pd.read_csv('new_file.csv')
list(df['age'])

[34, 56, 67, 89, 78, 23]

In [23]:
df = pd.read_csv('new_file.csv')
df['name'] == 'Ram'

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [24]:
df = pd.read_csv('new_file.csv')
df[df['name'] == 'Ram']

   sn name  age        add       phone
0   1  Ram   34  Kathmandu  9808667654

In [27]:
df = pd.read_csv('new_file.csv')
df[(df['age'] > 30) & (df['add']=='Kathmandu')]

   sn name  age        add       phone
0   1  Ram   34  Kathmandu  9808667654

In [29]:
data = df[(df['age'] > 30)]
data.to_csv('new_age_data.csv')

In [34]:
df = pd.read_csv('new_file.csv',index_col = 0)
df

     name  age        add        phone
sn
1     Ram   34  Kathmandu   9808667654
2   Shyam   56  Bhaktapur    980889887
3    Hari   67   Lalitpur   9808667654
4   Nabin   89       Bara  98400346765
5   Sabin   78    Chitwan   9808667654
6    Rita   23      Jhapa   9808776865

In [35]:
df.loc[2:5]

     name  age        add        phone
sn
2   Shyam   56  Bhaktapur    980889887
3    Hari   67   Lalitpur   9808667654
4   Nabin   89       Bara  98400346765
5   Sabin   78    Chitwan   9808667654

In [2]:
import pandas as pd
data = {'name':['Ram','Shyam','Hari'],
       'age':[78,89,56],
       'add':['Kathmandu','Bhaktapur','lalitpur']}

df= pd.DataFrame(data)
df.to_csv('info.csv')
df.to_json('info.json')

In [38]:
import csv
with open('info.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(row)

{'': '0', 'name': 'Ram', 'age': '78', 'add': 'Kathmandu'}
{'': '1', 'name': 'Shyam', 'age': '89', 'add': 'Bhaktapur'}
{'': '2', 'name': 'Hari', 'age': '56', 'add': 'lalitpur'}

In [40]:
import csv
data = [['name','age','add'],
       ['Ram',45,'Kathmandu'],
       ['Hari',56,'Lalitpur']]
file = open('list_file.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [41]:
pwd

'C:\\Users\\Aayush\\ClassPython3pm'